Repository: McModknower/nudoku
Catalog: po/*.po
Languages: tr, uk

source: nudoku [option]
tr: nudoku [seçenek]
uk: nudoku [опції]

source: Options:
tr: Seçenekler:
uk: Опції:

source: -h help: Print this help
tr: -h: Yardım metnini yazdır
uk: -h довідка: Надрукувати цю довідку

source: -v version: Print version
tr: -v: Sürüm numarasını yazdır
uk: -v версія: Надрукувати версію

source: -c nocolor: Do not use colors
tr: -c: Renkler kullanılmasın
uk: -c без кольорів: Не використовувати кольори

source: -d difficulty: Choose between: easy, normal, hard
tr: -d zorluk: Zorluk derecesini seç: easy, normal, hard
uk: -d складність: Обрати рівень: easy, normal, hard

source: -s stream: User provided sudoku stream
tr: -s tahta: Belirtilen sudoku tahtasını kullan
uk: -s потік: Наданий користувачем поток судоку

source: -r resume: Resume the last saved game
tr: -r resume: Son kaydedilen oyuna devam et
uk: -r продовжити: Продовжити останню збережену гру

source: -p filename: Output PDF
tr: -p dosyaadı: PDF olarak dışa aktar
uk: -p файл: Створити PDF документ

source: -n filename: Number of sudokus to put in PDF
tr: -n dosyaadı: PDF dosyasına yazılacak sudoku sayısı
uk: -n файл: Кількість судоку у PDF

source: -i filename: Output PNG image
tr: -i dosyaadı: PNG resmi olarak dışa aktar
uk: -i файл: Створити PNG світлину

source: Character %c at position %d is not allowed.
tr: %c karakterine %d konumunda izin verilmiyor.
uk: Символ %c в позиції %d не допускається.

source: Stream has to be %d characters long.
tr: Tahta %d karakter uzunluğunda olmalıdır.
uk: Поток має бути %d символів у довжину.

source: Stream does not represent a valid sudoku puzzle.
tr: Tahta geçerli bir sudoku bulmacası değil.
uk: Поток не є правильним судоку.

source: Game save is missing or corrupted, try starting new game.
tr: Oyun kaydı eksik veya bozuk, yeni oyun başlatmayı deneyin.
uk: Гра не була збережена або пошкоджена, спробуйте нову гру.

source: Your terminal doesn't support colors. Try the nocolor (-c) option.
tr: Terminaliniz renkleri desteklemiyor. Renksiz (-c) seçeneğini deneyin.
uk: Цей термінал не підтримує кольори Спробуйте опцію без кольору (-c).

source: level: %s
tr: seviye: %s
uk: Рівень: %s

source: Movement
tr: Hareket
uk: Переміщення

source: h - Move left
tr: h - Sola git
uk: h - Ліворуч

source: j - Move down
tr: j - Aşağı git
uk: j - Вниз

source: k - Move up
tr: k - Yukarı git
uk: k - Вверх

source: l - Move right
tr: l - Sağa git
uk: l - Праворуч

source: Commands
tr: Komutlar
uk: Команди

source: c - Check solution
tr: c - Çözümü denetle
uk: c - Перевірити судоку

source: H - Give a hint
tr: H - İpucu ver
uk: H - Дати підсказку

source: m - Toggle marks
tr: m - İşaretleri aç/kapat
uk: m - Переключити позначки

source: N - New puzzle
tr: N - Yeni bulmaca
uk: N - Нова головоломка

source: G - Save
tr: G - Kaydet
uk: G - Зберегти

source: Q - Quit
tr: Q - Çıkış
uk: Q - Вийти

source: r - Redraw
tr: r - Yeniden çiz
uk: r - Оновити екран

source: S - Solve puzzle
tr: S - Bulmacayı çöz
uk: S - Розв'язати головоломку

source: x - Delete number
tr: x - Sayıyı sil
uk: x - Видалити число

source: u - Undo previous action
tr: u - Önceki eylemi geri al
uk: u - Скасувати останню дію

source: nudoku is compiled without cairo support.
tr: nudoku cairo desteği olmadan derlendi.
uk: nudoku cкомпільований без підтримки cairo.

source: To use the output feature, please compile with --enable-cairo.
tr: Dışa aktarma özelliğini kullanmak için lütfen --enable-cairo ile derleyin.
uk: Для функціонування друку судоку використовуйте --enable-cairo при компіляції.

source: Solving puzzle...
tr: Bulmaca çözülüyor...
uk: Розв'язую головоломку...

source: Solved
tr: Çözüldü
uk: Розв'язано

source: Generating puzzle...
tr: Bulmaca oluşturuluyor...
uk: Створюю головоломку...

source: Not correct
tr: Doğru değil
uk: У вас помилка

source: with the help of %d hints
tr: %d ipucu yardımıyla

source: Correct so far
tr: Şimdiye kadar doğru
uk: Зараз правильно

source: Provided hint
tr: İpucu verildi
uk: Ви використали підсказку

source: Saved!
tr: Kaydedildi!
uk: Судоку збережено!

source: Can't save the game!
tr: Oyun kaydedilemiyor!
uk: Не можу зберегти гру!

source: hard
tr: zor
uk: складний

source: easy
tr: kolay
uk: легкий

source: normal
uk: нормальний
